#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_route53_zone.selected: Reading...
aws_s3_bucket_public_access_block.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:004351562122:certificate/fc15b73d-58cd-44e7-8567-0e710abfc077]
module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]: Refreshing state... [id=E3R7ITY1ZA9AK3]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_s3_bucket.logs: Refreshing state... [id=aheadinthecloud-log-logs-us-east-1-004351562122-prod]
data.aws_route53_zone.selected: Read complete after 1s [id=Z08846413OJRCH3MJOFHV]
aws_route53_record.acm["aheadinthecloud.com"]: Refreshing state... [id=Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-07-12 03:23:41.25 +0000 UTC]
aws_s3_bucket_website_configuration.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_s3_bucket_logging.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_route53_record.subdomain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A]
aws_route53_record.domain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.domain will be updated in-place
  ~ resource "aws_route53_record" "domain" {
        id                               = "Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A"
        name                             = "aheadinthecloud.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3AQBSTGFYJSTF" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_route53_record.subdomain will be updated in-place
  ~ resource "aws_route53_record" "subdomain" {
        id                               = "Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A"
        name                             = "www.aheadinthecloud.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3AQBSTGFYJSTF" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_logging.domain is tainted, so must be replaced
-/+ resource "aws_s3_bucket_logging" "domain" {
      ~ id            = "aheadinthecloud-us-east-1-004351562122-prod" -> (known after apply)
      ~ target_prefix = "s3" -> "s3/"
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.domain will be destroyed
  # (because aws_s3_bucket_public_access_block.domain is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "domain" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "aheadinthecloud-us-east-1-004351562122-prod" -> null
      - id                      = "aheadinthecloud-us-east-1-004351562122-prod" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "www.aheadinthecloud.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "aheadinthecloud.com distribution"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2and3"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = "aheadinthecloud-log-logs-us-east-1-004351562122-prod"
          + include_cookies = false
          + prefix          = "cloudfront/"
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = "*"
          + target_origin_id       = "s3"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "s3-website-us-east-1.amazonaws.com"
          + origin_access_control_id = "E3R7ITY1ZA9AK3"
          + origin_id                = "s3"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:004351562122:certificate/fc15b73d-58cd-44e7-8567-0e710abfc077"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_monitoring_subscription.this[0] will be created
  + resource "aws_cloudfront_monitoring_subscription" "this" {
      + distribution_id = (known after apply)
      + id              = (known after apply)

      + monitoring_subscription {
          + realtime_metrics_subscription_config {
              + realtime_metrics_subscription_status = "Enabled"
            }
        }
    }

Plan: 3 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*